Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة وإن تصبهم حسنة يقولوا هذه من عند الله وإن تصبهم سيئة يقولوا هذه من عندك قل كل من عند الله فمال هؤلاء القوم لا يكادون يفقهون حديثا
en: Wheresoever ye may be, death will overtake you, even though ye were in lofty towers. Yet if a happy thing befalleth them they say: This is from Allah; and if an evil thing befalleth them they say: This is of thy doing (O Muhammad). Say (unto them): All is from Allah. What is amiss with these people that they come not nigh to understand a happening?

source: ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك وأرسلناك للناس رسولا وكفى بالله شهيدا
en: Whatever of good befalleth thee (O man) it is from Allah, and whatever of ill befalleth thee it is from thyself. We have sent thee (Muhammad) as a messenger unto mankind and Allah is sufficient as Witness.

source: من يطع الرسول فقد أطاع الله ومن تولى فما أرسلناك عليهم حفيظا
en: Whoso obeyeth the messenger hath obeyed Allah, and whoso turneth away: We have not sent thee as a warder over them.

source: ويقولون طاعة فإذا برزوا من عندك بيت طائفة منهم غير الذي تقول والله يكتب ما يبيتون فأعرض عنهم وتوكل على الله وكفى بالله وكيلا
en: And they say: (It is) obedience; but when they have gone forth from thee a party of them spend the night in planning other than what thou sayest. Allah recordeth what they plan by night. So oppose them and put thy trust in Allah. Allah is sufficient as Trustee.

source: أفلا يتدبرون القرآن ولو كان من عند غير الله لوجدوا فيه اختلافا كثيرا
en: Will they not then ponder on the Qur'an? If it had been from other than Allah they would have found therein much incongruity.

source: وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم ولولا فضل الله عليكم ورحمته لاتبعتم الشيطان إلا قليلا
en: And if any tidings, whether of safety or fear, come unto them, they noise it abroad, whereas if they had referred it to the messenger and to such of them as are in authority, those among them who are able to think out the matter would have known it. If it had not been for the grace of Allah upon you and His mercy ye would have followed Satan, save a few (of you).

source: فقاتل في سبيل الله لا تكلف إلا نفسك وحرض المؤمنين عسى الله أن يكف بأس الذين كفروا والله أشد بأسا وأشد تنكيلا
en: So fight (O Muhammad) in the way of Allah Thou art not taxed (with the responsibility for anyone) except thyself - and urge on the believers. Peradventure Allah will restrain the might of those who disbelieve. Allah is stronger in might and stronger in inflicting punishment.

source: من يشفع شفاعة حسنة يكن له نصيب منها ومن يشفع شفاعة سيئة يكن له كفل منها وكان الله على كل شيء مقيتا
en: Whoso interveneth in a good cause will have the reward thereof, and whoso interveneth in an evil cause will bear the consequence thereof. Allah overseeth all things.

source: وإذا حييتم بتحية فحيوا بأحسن منها أو ردوها إن الله كان على كل شيء حسيبا
en: When ye are greeted with a greeting, greet ye with a better than it or return it. Lo! Allah taketh count of all things.

source: الله لا إله إلا هو ليجمعنكم إلى يوم القيامة لا ريب فيه ومن أصدق من الله حديثا
en: Allah! There is no Allah save Him. He gathereth you all unto a Day of Resurrection whereof there is no doubt. Who is more true in statement than Allah?

source: فما لكم في المنافقين فئتين والله أركسهم بما كسبوا أتريدون أن تهدوا من أضل الله ومن يضلل الله فلن تجد له سبيلا
en: What aileth you that ye are become two parties regarding the hypocrites, when Allah cast them back (to disbelief) because of what they earned? Seek ye to guide him whom Allah hath sent astray? He whom Allah sendeth astray, for him thou (O MUhammad) canst not find a road.

source: ودوا لو تكفرون كما كفروا فتكونون سواء فلا تتخذوا منهم أولياء حتى يهاجروا في سبيل الله فإن تولوا فخذوهم واقتلوهم حيث وجدتموهم ولا تتخذوا منهم وليا ولا نصيرا
en: They long that ye should disbelieve even as they disbelieve, that ye may be upon a level (with them). So choose not friends from them till they forsake their homes in the way of Allah; if they turn back (to enmity) then take them and kill them wherever ye find them, and choose no friend nor helper from among them,

source: إلا الذين يصلون إلى قوم بينكم وبينهم ميثاق أو جاءوكم حصرت صدورهم أن يقاتلوكم أو يقاتلوا قومهم ولو شاء الله لسلطهم عليكم فلقاتلوكم فإن اعتزلوكم فلم يقاتلوكم وألقوا إليكم السلم فما جعل الله لكم عليهم سبيلا
en: Except those who seek refuge with a people between whom and you there is a covenant, or (those who) come unto you because their hearts forbid them to make war on you or make war on their own folk. Had Allah willed He could have given them power over you so that assuredly they would have fought you. So, if they hold aloof from you and wage not war against you and offer you peace, Allah alloweth you no way against them.

source: ستجدون آخرين يريدون أن يأمنوكم ويأمنوا قومهم كل ما ردوا إلى الفتنة أركسوا فيها فإن لم يعتزلوكم ويلقوا إليكم السلم ويكفوا أيديهم فخذوهم واقتلوهم حيث ثقفتموهم وأولئكم جعلنا لكم عليهم سلطانا مبينا
en: Ye will find others who desire that they should have security from you, and security from their own folk. So often as they are returned to hostility they are plunged therein. If they keep not aloof from you nor offer you peace nor hold their hands, then take them and kill them wherever ye find them. Against such We have given you clear warrant.

source: وما كان لمؤمن أن يقتل مؤمنا إلا خطأ ومن قتل مؤمنا خطأ فتحرير رقبة مؤمنة ودية مسلمة إلى أهله إلا أن يصدقوا فإن كان من قوم عدو لكم وهو مؤمن فتحرير رقبة مؤمنة وإن كان من قوم بينكم وبينهم ميثاق فدية مسلمة إلى أهله وتحرير رقبة مؤمنة فمن لم يجد فصيام شهرين متتابعين توبة من الله وكان الله عليما حكيما
en: It is not for a believer to kill a believer unless (it be) by mistake. He who hath killed a believer by mistake must set free a believing slave, and pay the blood-money to the family of the slain, unless they remit it as a charity. If he (the victim) be of a people hostile unto you, and he is a believer, then (the penance is) to set free a believing slave. And if he cometh of a folk between whom and you there is a covenant, then the blood-money must be paid unto his folk and (also) a believing slave must be set free. And whoso hath not the wherewithal must fast two consecutive months. A penance from Allah. Allah is Knower, Wise.

source: ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه وأعد له عذابا عظيما
en: Whoso slayeth a believer of set purpose, his reward is hell for ever. Allah is wroth against him and He hath cursed him and prepared for him an awful doom.

source: يا أيها الذين آمنوا إذا ضربتم في سبيل الله فتبينوا ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا تبتغون عرض الحياة الدنيا فعند الله مغانم كثيرة كذلك كنتم من قبل فمن الله عليكم فتبينوا إن الله كان بما تعملون خبيرا
en: O ye who believe! When ye go forth (to fight) in the way of Allah, be careful to discriminate, and say not unto one who offereth you peace: "Thou art not a believer," seeking the chance profits of this life (so that ye may despoil him). With Allah are plenteous spoils. Even thus (as he now is) were ye before; but Allah hath since then been gracious unto you. Therefore take care to discriminate. Allah is ever Informed of what ye do.

source: لا يستوي القاعدون من المؤمنين غير أولي الضرر والمجاهدون في سبيل الله بأموالهم وأنفسهم فضل الله المجاهدين بأموالهم وأنفسهم على القاعدين درجة وكلا وعد الله الحسنى وفضل الله المجاهدين على القاعدين أجرا عظيما
en: Those of the believers who sit still, other than those who have a (disabling) hurt, are not on an equality with those who strive in the way of Allah with their wealth and lives. Allah hath conferred on those who strive with their wealth and lives a rank above the sedentary. Unto each Allah hath promised good, but He hath bestowed on those who strive a great reward above the sedentary;

source: درجات منه ومغفرة ورحمة وكان الله غفورا رحيما
en: Degrees of rank from Him, and forgiveness and mercy. Allah is ever Forgiving, Merciful.

source: إن الذين توفاهم الملائكة ظالمي أنفسهم قالوا فيم كنتم قالوا كنا مستضعفين في الأرض قالوا ألم تكن أرض الله واسعة فتهاجروا فيها فأولئك مأواهم جهنم وساءت مصيرا
en: Lo! as for those whom the angels take (in death) while they wrong themselves, (the angels) will ask: In what were ye engaged? They will say: We were oppressed in the land. (The angels) will say: Was not Allah's earth spacious that ye could have migrated therein? As for such, their habitation will be hell, an evil journey's end;

source: إلا المستضعفين من الرجال والنساء والولدان لا يستطيعون حيلة ولا يهتدون سبيلا
en: Except the feeble among men, and the women, and the children, who are unable to devise a plan and are not shown a way.

source: فأولئك عسى الله أن يعفو عنهم وكان الله عفوا غفورا
en: As for such, it may be that Allah will pardon them. Allah is ever Clement, Forgiving.

source: ومن يهاجر في سبيل الله يجد في الأرض مراغما كثيرا وسعة ومن يخرج من بيته مهاجرا إلى الله ورسوله ثم يدركه الموت فقد وقع أجره على الله وكان الله غفورا رحيما
en: Whoso migrateth for the cause of Allah will find much refuge and abundance in the earth, and whoso forsaketh his home, a fugitive unto Allah and His messenger, and death overtaketh him, his reward is then incumbent on Allah. Allah is ever Forgiving, Merciful.

source: وإذا ضربتم في الأرض فليس عليكم جناح أن تقصروا من الصلاة إن خفتم أن يفتنكم الذين كفروا إن الكافرين كانوا لكم عدوا مبينا
en: And when ye go forth in the land, it is no sin for you to curtail (your) worship if ye fear that those who disbelieve may attack you. In truth the disbelievers are an open enemy to you.

source: وإذا كنت فيهم فأقمت لهم الصلاة فلتقم طائفة منهم معك وليأخذوا أسلحتهم فإذا سجدوا فليكونوا من ورائكم ولتأت طائفة أخرى لم يصلوا فليصلوا معك وليأخذوا حذرهم وأسلحتهم ود الذين كفروا لو تغفلون عن أسلحتكم وأمتعتكم فيميلون عليكم ميلة واحدة ولا جناح عليكم إن كان بكم أذى من مطر أو كنتم مرضى أن تضعوا أسلحتكم وخذوا حذركم إن الله أعد للكافرين عذابا مهينا
en: And when thou (O Muhammad) art among them and arrangest (their) worship for them, let only a party of them stand with thee (to worship) and let them take their arms. Then when they have performed their prostrations let them fall to the rear and let another party come that hath not worshipped and let them worship with thee, and let them take their precaution and their arms. Those who disbelieve long for you to neglect your arms and your baggage that they may attack you once for all. It is no sin for you to lay aside your arms, if rain impedeth you or ye are sick. But take your precaution. Lo! Allah prepareth for the disbelievers shameful punishment.

source: فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا وعلى جنوبكم فإذا اطمأننتم فأقيموا الصلاة إن الصلاة كانت على المؤمنين كتابا موقوتا
en: When ye have performed the act of worship, remember Allah, standing, sitting and reclining. And when ye are in safety, observe proper worship. Worship at fixed times hath been enjoined on the believers.

source: ولا تهنوا في ابتغاء القوم إن تكونوا تألمون فإنهم يألمون كما تألمون وترجون من الله ما لا يرجون وكان الله عليما حكيما
en: Relent not in pursuit of the enemy. If ye are suffering, lo! they suffer even as ye suffer and ye hope from Allah that for which they cannot hope. Allah is ever Knower, Wise.

source: إنا أنزلنا إليك الكتاب بالحق لتحكم بين الناس بما أراك الله ولا تكن للخائنين خصيما
en: Lo! We reveal unto thee the Scripture with the truth, that thou mayst judge between mankind by that which Allah showeth thee. And be not thou a pleader for the treacherous;

source: واستغفر الله إن الله كان غفورا رحيما
en: And seek forgiveness of Allah. Lo! Allah is ever Forgiving, Merciful.

source: ولا تجادل عن الذين يختانون أنفسهم إن الله لا يحب من كان خوانا أثيما
en: And plead not on behalf of (people) who deceive themselves. Lo! Allah loveth not one who is treacherous and sinful.

source: يستخفون من الناس ولا يستخفون من الله وهو معهم إذ يبيتون ما لا يرضى من القول وكان الله بما يعملون محيطا
en: They seek to hide from men and seek not to hide from Allah. He is with them when by night they hold discourse displeasing unto Him. Allah ever surroundeth what they do.

source: ها أنتم هؤلاء جادلتم عنهم في الحياة الدنيا فمن يجادل الله عنهم يوم القيامة أم من يكون عليهم وكيلا
en: Ho! ye are they who pleaded for them in the life of the world. But who will plead with Allah for them on the Day of Resurrection, or who will then be their defender?

source: ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما
en: Yet whoso doeth evil or wrongeth his own soul, then seeketh pardon of Allah, will find Allah Forgiving, Merciful.

source: ومن يكسب إثما فإنما يكسبه على نفسه وكان الله عليما حكيما
en: Whoso committeth sin committeth it only against himself. Allah is ever Knower, Wise.

source: ومن يكسب خطيئة أو إثما ثم يرم به بريئا فقد احتمل بهتانا وإثما مبينا
en: And whoso committeth a delinquency or crime, then throweth (the blame) thereof upon the innocent, hath burdened himself with falsehood and a flagrant crime.

source: ولولا فضل الله عليك ورحمته لهمت طائفة منهم أن يضلوك وما يضلون إلا أنفسهم وما يضرونك من شيء وأنزل الله عليك الكتاب والحكمة وعلمك ما لم تكن تعلم وكان فضل الله عليك عظيما
en: But for the grace of Allah upon thee (Muhammad), and His mercy, a party of them had resolved to mislead thee, but they will mislead only themselves and they will hurt thee not at all. Allah revealeth unto thee the Scripture and wisdom, and teacheth thee that which thou knewest not. The grace of Allah toward thee hath been infinite.

source: لا خير في كثير من نجواهم إلا من أمر بصدقة أو معروف أو إصلاح بين الناس ومن يفعل ذلك ابتغاء مرضات الله فسوف نؤتيه أجرا عظيما
en: There is no good in much of their secret conferences save (in) him who enjoineth almsgiving and kindness and peace-making among the people. Whoso doeth that, seeking the good pleasure of Allah, We shall bestow on him a vast reward.

source: ومن يشاقق الرسول من بعد ما تبين له الهدى ويتبع غير سبيل المؤمنين نوله ما تولى ونصله جهنم وساءت مصيرا
en: And whoso opposeth the messenger after the guidance (of Allah) hath been manifested unto him, and followeth other than the believer's way, We appoint for him that unto which he himself hath turned, and expose him unto hell - a hapless journey's end!

source: إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك بالله فقد ضل ضلالا بعيدا
en: Lo! Allah pardoneth not that partners should be ascribed unto Him. He pardoneth all save that to whom He will. Whoso ascribeth partners unto Allah hath wandered far astray.

source: إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا
en: They invoke in His stead only females; they pray to none else than Satan, a rebel

source: لعنه الله وقال لأتخذن من عبادك نصيبا مفروضا
en: Whom Allah cursed, and he said: Surely I will take of Thy bondmen an appointed portion,

source: ولأضلنهم ولأمنينهم ولآمرنهم فليبتكن آذان الأنعام ولآمرنهم فليغيرن خلق الله ومن يتخذ الشيطان وليا من دون الله فقد خسر خسرانا مبينا
en: And surely I will lead them astray, and surely I will arouse desires in them, and surely I will command them and they will cut the cattle' ears, and surely I will command them and they will change Allah's creation. Whoso chooseth Satan for a patron instead of Allah is verily a loser and his loss is manifest.

source: يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا
en: He promiseth them and stirreth up desires in them, and Satan promiseth them only to beguile.

source: أولئك مأواهم جهنم ولا يجدون عنها محيصا
en: For such, their habitation will be hell, and they will find no refuge therefrom.

source: والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا وعد الله حقا ومن أصدق من الله قيلا
en: But as for those who believe and do good works We shall bring them into Gardens underneath which rivers flow, wherein they will abide for ever. It is a promise from Allah in truth; and who can be more truthful than Allah in utterance?

source: ليس بأمانيكم ولا أماني أهل الكتاب من يعمل سوءا يجز به ولا يجد له من دون الله وليا ولا نصيرا
en: It will not be in accordance with your desires, nor the desires of the People of the Scripture. He who doeth wrong will have the recompense thereof, and will not find against Allah any protecting friend or helper.

source: ومن يعمل من الصالحات من ذكر أو أنثى وهو مؤمن فأولئك يدخلون الجنة ولا يظلمون نقيرا
en: And whoso doeth good works, whether of male or female, and he (or she) is a believer, such will enter paradise and they will not be wronged the dint in a date-stone.

source: ومن أحسن دينا ممن أسلم وجهه لله وهو محسن واتبع ملة إبراهيم حنيفا واتخذ الله إبراهيم خليلا
en: Who is better in religion than he who surrendereth his purpose to Allah while doing good (to men) and followeth the tradition of Abraham, the upright? Allah (Himself) chose Abraham for friend.

source: ولله ما في السماوات وما في الأرض وكان الله بكل شيء محيطا
en: Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. Allah ever surroundeth all things.

source: ويستفتونك في النساء قل الله يفتيكم فيهن وما يتلى عليكم في الكتاب في يتامى النساء اللاتي لا تؤتونهن ما كتب لهن وترغبون أن تنكحوهن والمستضعفين من الولدان وأن تقوموا لليتامى بالقسط وما تفعلوا من خير فإن الله كان به عليما
en: They consult thee concerning women. Say: Allah giveth you decree concerning them, and the Scripture which hath been recited unto you (giveth decree), concerning female orphans and those unto whom ye give not that which is ordained for them though ye desire to marry them, and (concerning) the weak among children, and that ye should deal justly with orphans. Whatever good ye do, lo! Allah is ever Aware of it.

source: وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير وأحضرت الأنفس الشح وإن تحسنوا وتتقوا فإن الله كان بما تعملون خبيرا
en: If a woman feareth ill treatment from her husband, or desertion, it is no sin for them twain if they make terms of peace between themselves. Peace is better. But greed hath been made present in the minds (of men). If ye do good and keep from evil, lo! Allah is ever Informed of what ye do.

source: ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم فلا تميلوا كل الميل فتذروها كالمعلقة وإن تصلحوا وتتقوا فإن الله كان غفورا رحيما
en: Ye will not be able to deal equally between (your) wives, however much ye wish (to do so). But turn not altogether away (from one), leaving her as in suspense. If ye do good and keep from evil, lo! Allah is ever Forgiving, Merciful.

source: وإن يتفرقا يغن الله كلا من سعته وكان الله واسعا حكيما
en: But if they separate, Allah will compensate each out of His abundance. Allah is ever All-Embracing, All-Knowing.

source: ولله ما في السماوات وما في الأرض ولقد وصينا الذين أوتوا الكتاب من قبلكم وإياكم أن اتقوا الله وإن تكفروا فإن لله ما في السماوات وما في الأرض وكان الله غنيا حميدا
en: Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. And We charged those who received the Scripture before you, and (We charge) you, that ye keep your duty toward Allah. And if ye disbelieve, lo! unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth, and Allah is ever Absolute, Owner of Praise.

source: ولله ما في السماوات وما في الأرض وكفى بالله وكيلا
en: Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. And Allah is sufficient as Defender.

source: إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا
en: If He will, He can remove you, O people, and produce others (in your stead). Allah is Able to do that.

source: من كان يريد ثواب الدنيا فعند الله ثواب الدنيا والآخرة وكان الله سميعا بصيرا
en: Whoso desireth the reward of the world, (let him know that) with Allah is the reward of the world and the Hereafter. Allah is ever Hearer, Seer.

source: يا أيها الذين آمنوا كونوا قوامين بالقسط شهداء لله ولو على أنفسكم أو الوالدين والأقربين إن يكن غنيا أو فقيرا فالله أولى بهما فلا تتبعوا الهوى أن تعدلوا وإن تلووا أو تعرضوا فإن الله كان بما تعملون خبيرا
en: O ye who believe! Be ye staunch in justice, witnesses for Allah, even though it be against yourselves or (your) parents or (your) kindred, whether (the case be of) a rich man or a poor man, for Allah is nearer unto both (them ye are). So follow not passion lest ye lapse (from truth) and if ye lapse or fall away, then lo! Allah is ever Informed of what ye do.

source: يا أيها الذين آمنوا آمنوا بالله ورسوله والكتاب الذي نزل على رسوله والكتاب الذي أنزل من قبل ومن يكفر بالله وملائكته وكتبه ورسله واليوم الآخر فقد ضل ضلالا بعيدا
en: O ye who believe! Believe in Allah and His messenger and the Scripture which He hath revealed unto His messenger, and the Scripture which He revealed aforetime. Whoso disbelieveth in Allah and His angels and His scriptures and His messengers and the Last Day, he verily hath wandered far astray.

source: إن الذين آمنوا ثم كفروا ثم آمنوا ثم كفروا ثم ازدادوا كفرا لم يكن الله ليغفر لهم ولا ليهديهم سبيلا
en: Lo! those who believe, then disbelieve and then (again) believe, then disbelieve, and then increase in disbelief, Allah will never pardon them, nor will He guide them unto a way.

source: بشر المنافقين بأن لهم عذابا أليما
en: Bear unto the hypocrites the tidings that for them there is a painful doom;

source: الذين يتخذون الكافرين أولياء من دون المؤمنين أيبتغون عندهم العزة فإن العزة لله جميعا
en: Those who chose disbelievers for their friends instead of believers! Do they look for power at their hands? Lo! all power appertaineth to Allah.

source: وقد نزل عليكم في الكتاب أن إذا سمعتم آيات الله يكفر بها ويستهزأ بها فلا تقعدوا معهم حتى يخوضوا في حديث غيره إنكم إذا مثلهم إن الله جامع المنافقين والكافرين في جهنم جميعا
en: He hath already revealed unto you in the Scripture that, when ye hear the revelations of Allah rejected and derided, (ye) sit not with them (who disbelieve and mock) until they engage in some other conversation. Lo! in that case (if ye stayed) ye would be like unto them. Lo! Allah will gather hypocrites and disbelievers, all together, into hell;

source: الذين يتربصون بكم فإن كان لكم فتح من الله قالوا ألم نكن معكم وإن كان للكافرين نصيب قالوا ألم نستحوذ عليكم ونمنعكم من المؤمنين فالله يحكم بينكم يوم القيامة ولن يجعل الله للكافرين على المؤمنين سبيلا
en: Those who wait upon occasion in regard to you and, if a victory cometh unto you from Allah, say: Are we not with you? and if the disbelievers meet with a success say: Had we not the mastery of you, and did we not protect you from the believers? - Allah will judge between you at the Day of Resurrection, and Allah will not give the disbelievers any way (of success) against the believers.

source: إن المنافقين يخادعون الله وهو خادعهم وإذا قاموا إلى الصلاة قاموا كسالى يراءون الناس ولا يذكرون الله إلا قليلا
en: Lo! the hypocrites seek to beguile Allah, but it is He Who beguileth them. When they stand up to worship they perform it languidly and to be seen of men, and are mindful of Allah but little;

source: مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ومن يضلل الله فلن تجد له سبيلا
en: Swaying between this (and that), (belonging) neither to these nor to those. He whom Allah causeth to go astray, thou (O Muhammad) wilt not find a way for him:

source: يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا
en: O ye who believe! Choose not disbelievers for (your) friends in place of believers. Would ye give Allah a clear warrant against you?

source: إن المنافقين في الدرك الأسفل من النار ولن تجد لهم نصيرا
en: Lo! the hypocrites (will be) in the lowest deep of the Fire, and thou wilt find no helper for them;

source: إلا الذين تابوا وأصلحوا واعتصموا بالله وأخلصوا دينهم لله فأولئك مع المؤمنين وسوف يؤت الله المؤمنين أجرا عظيما
en: Save those who repent and amend and hold fast to Allah and make their religion pure for Allah (only). Those are with the believers. And Allah will bestow on the believers an immense reward.
